# Bot token
BOT_TOKEN = "7932241612:AAE3E8IXOeMSo0Trpv4DIDKwkufzEhFEurc"

# Channel ID where messages will be forwarded
CHANNEL_ID = -1002490149062

# Bot messages
WELCOME_MESSAGE = (
    "Привет, {user_name}! Если написал — пиши сюда. Проза, поэзия — неважно. "
    "Мы обязательно прочтём любую твою писанину, но имей в виду, что откровенную чушь мы не пропускаем, "
    "а хорошую работу откровенно любим.\n\n"
    "Не забудь вставить ссылку на своё творчество, "
    "мы обязательно тебя прорекламируем, но только в том случае, если твоя работа нам приглянулась. "
    "Нравится нам немногое, но будь уверен — ты нам обязательно понравишься."
)

RESPONSE_MESSAGES = [
    "​​Наша редакция отменила все свои планы и только что приступила к рассмотрению твоей работы. Тебе остаётся только ждать её публикации. Если этого не произошло через две недели, то варианта два: либо твой текст затерялся в предложке, потому что нашёлся тот, кто написал что-то чуть получше твоего (или мы потеряли твою работу, но скоро обязательно найдём!), либо ты просто написал полную чушь, и мы тебя выкинули. Но ведь ты бы не стал, да?",
    "Редакция уже начала рьяно продираться через сотни посредственных текстов к твоему шедевру. Предлагаем тебе забыть о том, что ты сюда что-то отправлял. Так, когда ты прочтёшь первую строку своего произведения в окне уведомления, ты почувствуешь радость и теплоту нежданного подарка, будто обнаружил пачку сигарет в кармане старого пальто.",
    "Редакция уже спешит ознакомиться с твоей работой. Надеемся, ты прислал нам не полное говно. Если же ты прислал нам полное говно, мы его не опубликуем. Понять это ты сможешь через три-четыре недели. Если твоя писанина не оказалась на стене лучшего литературного журнала, — ты прислал говно. И не надо отправлять нам его заново. Пришли лучше что-нибудь другое. Получше того, что ты уже присылал ранее.",
    "Редакция отказалась от личной жизни и только что начала читать твой текст. Возможно, мы опубликуем тебя в лучшем литературном журнале. Возможно, не опубликуем. Возможно ведь такое, что ты прислал нам откровенно слабый текст? Ещё как возможно. Более того, скорее всего, так и есть. Но не отчаивайся, присылай ещё. Что-то сносное у тебя наверняка имеется.",
    "Редакция отложила работы других авторов и приступила к оцениванию именно твоей писанины. Ничего не обещаем, писатель. Хороший текст — опубликуем, плохой — не опубликуем. Жди несколько недель.",
    "Редакции не терпится оценить ещё одно произведение искусства. Или не произведение искусства? Конечно, нет. Однако, вполне возможно, что ты прислал нам неплохой текст. Тогда жди три недели, или четыре (или даже пять). Если за это время тебя не опубликовали, значит большинство из членов редакции отклонили твою работу (или она просто не понравилась главному редактору). Ты же не коммунист? Допустим, что нет. Тогда у тебя есть ещё шанс.",
    "Из тысячи работ в предложке «Литра» редакция выбрала на оценку именно твою. Жди публикации, писака. Если, конечно, ты не отправил нам дерьмо. Если ты отправил нам дерьмо — не жди.",
    "​​Наша редакция отменила все свои планы и только что приступила к рассмотрению твоей работы. Тебе остаётся только ждать её публикации. Если этого не произошло через три недели, то варианта два: либо твой текст затерялся в предложке, потому что нашёлся тот, кто написал что-то чуть получше твоего (или мы потеряли твою работу, но скоро обязательно найдём!), либо ты просто написал полную чушь, и мы тебя выкинули. Но ведь ты бы не стал, да?"
]